Revit 2024 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNotEnoughRefs Property
 Structural Connection Handler cannot connect fewer than two elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralConnectionNotEnoughRefs { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionNotEnoughRefs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionNotEnoughRefs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace